#language: ru

@tree

Функционал: модуль 5 задание 2

Как Тестировщик я хочу
проверить заполнения поля Организация из Соглашения
чтобы убедиься что система не падает при таких нагрузках    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: заполнение поля Организация из Соглашения

	Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
	И я нажимаю на кнопку с именем 'FormCreate'
	И я нажимаю кнопку выбора у поля с именем 'Agreement'
	И в таблице 'List' я перехожу к строке:
		| 'Код' | 'Наименование'                                                    | 'Вид'     | 'Вид взаиморасчетов'         |
		| '10'  | 'Тест'                                                            | 'Обычное' | 'По стандартным соглашениям' |
	И в таблице 'List' я выбираю текущую строку
	Если элемент формы с именем 'Company' стал равен "" Тогда
		И я нажимаю кнопку выбора у поля с именем 'Company'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"           |
			| "2"   | "Собственная компания 2" |
		И в таблице 'List' я выбираю текущую строку				