#language: ru

@tree

Функционал: модуль 5 урок 3 секция переменных

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Переменные:
	
Импорт "Экспорт переменных.feature"

МногострочнаяСтрока =
	"""
	ЧастьСтроки1
	ЧастьСтроки2
	"""

//Контекст:
//	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
//
//Сценарий: открытие формы списка поступления товаров и услуг
//
//	И В командном интерфейсе я выбираю "ЗаголовокПодсистемаЗакупок" "ЗаголовокФормыСпискаПоступления"
	
//Сценарий: проверка суммы Документа поступления
//
//	И у элемента формы с именем 'ItemListTotalTotalAmount' текст редактирования стал равен "ПроверяемыеЗначения.СуммаДокументаПоступления.Значение"

//Сценарий: проверка итоговой суммы отчета Закупки
//
//	И в табличном документе 'Result' я перехожу к ячейке "ИтоговаяСуммаОтчетаЗакупки"

Сценарий: проверка сообщений

	И Я запоминаю значение выражения 'StrTemplate($СообщениеШтрихКодНеНайден$, "123")' в переменную "ИмяПеременной2"
	Дано В последнем сообщении TestClient есть строка "$ИмяПеременной2$"
	
	
