#language: ru

@tree

Функционал: проверка полей Партнер, Соглашение, Контрагент документа заказ покупателя

Как Тестировщик я хочу
проверит заполнение полей Партнер, Соглашение, Контрагент 
чтобы у пользователя не возникло проблем при их использовании

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения
	
Сценарий: _0410 подготовительный сценарий (заказ покупателя)

	Когда экспорт основных данных

Сценарий: _0411 проверка заполнения полей

	* Проверка заполнения поля Соглашение когда с Партнером только одно Соглашение

		Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
		И я нажимаю на кнопку с именем 'FormCreate'
		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"            |
			| "1"   | "Клиент 1 (1 соглашение)" |
		И в таблице 'List' я выбираю текущую строку
		Тогда элемент формы с именем 'Agreement' стал равен "Соглашение с клиентами (расчет по документам + кредитный лимит)"

	* Проверка перезаполнения поля Соглашение при изменении Партнера (одно Соглашение)

		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"         |
			| "10"  | "Розничный покупатель" |
		И в таблице 'List' я выбираю текущую строку
		Тогда открылось окно "Табличная часть товаров будет обновлена"
		И я нажимаю на кнопку с именем 'FormOK'
		Тогда элемент формы с именем 'Agreement' стал равен "Розничное"			
		
	* Проверка заполнения поля Соглашение когда с Партнером больше одного Соглашения

		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"            |
			| "2"   | "Клиент 2 (2 соглашения)" |
		И в таблице 'List' я выбираю текущую строку
		Тогда элемент формы с именем 'Agreement' стал равен ""
				
	* Проверка заполнения поля Соглашение когда с Партнером нет ни одного Соглашения

		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"              |
			| "13"  | "Тестовый (без соглашения)" |
		И в таблице 'List' я выбираю текущую строку
		Тогда элемент формы с именем 'Agreement' стал равен ""

	* Проверка блокировки поля Контрагент когда не выбран Партнер			
					
		И в поле с именем 'Partner' я ввожу текст ""
		И элемент формы с именем 'LegalName' не доступен
				
	* Проверка доступности поля Контрагент когда выбран Партнер			
					
		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"            |
			| "1"   | "Клиент 1 (1 соглашение)" |
		И в таблице 'List' я выбираю текущую строку
		И Проверяю шаги на Исключение:
			|'И элемент формы с именем "LegalName" не доступен'|				