#language: ru

@tree
@ПрикреплениеФайлов

Функционал: финальное задание 7_1

Как Тестировщик я хочу
проверить прикрепление картинки в карточку Товара 
чтобы у пользователей не возникло трудностей   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: _0701 прикрепление файла картинки к элементу справочника Товары
	
	* Открытие элемента

		Дано Я открываю навигационную ссылку "e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8ea92d97a749"

	* Превдарительная очистка существующей картинки

		И я нажимаю кнопку очистить у поля с именем "ФайлКартинки"
		И я нажимаю на кнопку с именем 'ФормаЗаписать'

	* Добавление картинки в файлы

		И в текущем окне я нажимаю кнопку командного интерфейса 'Файлы'
		И я нажимаю на кнопку с именем 'Создать'
		И в поле с именем 'Наименование' я ввожу текст 'Колбаса'
		И я выбираю файл 'C:\VA_Tests\GitHub\TestQA\Features_IRP\Files\itempicture1.png'
		И я нажимаю на кнопку с именем "ВыбратьФайлСДискаИЗаписать"
		И Пауза 5
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'

	* Выбор картинки
		
		И в текущем окне я нажимаю кнопку командного интерфейса 'Основное'
		И я нажимаю кнопку выбора у поля с именем "ФайлКартинки"
		Тогда открылось окно 'Файлы'
		И в таблице 'Список' я перехожу к строке:
			| "Наименование" |
			| "Колбаса"      |
		И в таблице 'Список' я выбираю текущую строку
		И я нажимаю на кнопку с именем 'ОбновитьКартинку'

	* Проверка 

		И элемент формы с именем "ФайлКартинки" стал равен 'Колбаса'
	
	* Запись элемента

		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'

	* Закрытие всех окон

		И я закрываю все окна клиентского приложения