#language: ru

@tree
@Отчеты

Функционал: финальное задание 7_2

Как Тестировщик я хочу
проверить работу отчета Остатки товаров
чтобы он отражал верные данные   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: _0702 проверка отчета Остатки товаров

	* Открытие отчета

		И В командном интерфейсе я выбираю 'Товарные запасы' 'Остатки товаров'

	* Выбор варианта отчета Основной

		И я нажимаю на кнопку с именем 'ФормаЗагрузитьВариант'
		И в таблице "СписокНастроек" я перехожу к строке:
			| 'Представление' |
			| 'Основной'      |
		И я нажимаю на кнопку с именем 'Загрузить'
		И Пауза 10
		
	* Формирование и проверка

		И я нажимаю на кнопку с именем 'ФормаСформировать'
		И табличный документ "Результат" содержит строки из макета "ОстаткиТоваров" по шаблону

	* Закрытие всех окон

		И я закрываю все окна клиентского приложения